package codingTest;

public class permutation {

	public static void main(String[] args) {
//		Summary:
//			길이가 n인 배열을 매개변수로 받아, 1~n까지의 숫자가 중복해서 없이 모두 들어있는지 확인하는 메소드를 만드는 문제
//
//			문제설명
//			길이가 n인 배열에 1부터 n까지 숫자가 중복 없이 한 번씩 들어 있는지를 확인하려고 합니다. 1부터 n까지 숫자가 중복 없이 한 번씩 들어 있는 경우 true를, 아닌 경우 false를 반환하도록 함수 solution을 완성해주세요.
//
//			제한사항
//
//			배열의 길이는 10만 이하입니다.
//			배열의 원소는 10만 이하의 자연수입니다.
//			첫 풀이
//			예를 들어 [1, 3, 2] 라는 배열이 주어지면 배열의 길이는 3이므로 배열 안에 1, 2, 3이라는 숫자가 들어있는지 확인하고, 맞으면 True 만약 [1, 3, 4] 혹은 [1, 2, 2] 처럼 중복이나 배열의 길이를 벗어나는 숫자가 있다면 False 를 반환하면 된다.

		
		
	}

}
